greet = '🏧 Привет, <code>{name}</code>. Ты находишься в <code>EveryExchange</code>!'

info = '🏷 Количество успешных транзакций: <code>{suc_trans}</code>\n' \
       '\n' \
       '<code>- Нашли баг?</code>\n' \
       '<code>- Нет необходимого сервиса?</code>\n' \
       '<code>- Есть предложения или вопросы?</code>\n' \
       '\n' \
       'Пишем администратору: <a href="https://t.me/Anubis_SPB">@Anubis_SPB</a>'
profile_info = '❇️ Вы находитесь в своем профиле!\n' \
               '➖➖➖➖➖➖➖➖➖➖\n' \
               '🌐 ID: <code>{user_id}</code>\n' \
               '💎 Баланс: <code>{user_balance}</code> RUB\n' \
               '⏱ Общая сумма пополнения: <code>{total_amount}</code> RUB\n' \
               '💤 Проведено транзакций: <code>{suc_trans}</code> шт.\n' \
               '➖➖➖➖➖➖➖➖➖➖\n' \
               '🔗 <code>new update - coming soon</code>\n'

sum_trx_buy = 'Введите количество TRON для покупки (курс TRX: 12 рублей = 1 TRX).'
small_amount_trx = 'Вы пытаетесь купить <code>{amount_trx} TRON</code>\n'\
                    'Минимальное значение - <code>5 TRON</code>'

buy_trx_message = '🛃 Мы подсчитали Вашу конвертацию:\n' \
                  '🅿️ Ваша сумма в RUB - <code>{amount} RUB</code>\n' \
                  '♻️ Ваша сумма в TRX - <code>{amount_change} TRX TRON</code>\n' \
                  'Ваш баланс: <code>{user_balance}</code>'

pay_balance = 'Укажите сумму для пополнения в рублях:'
set_wallet = 'Введите ваш кошелек:'

set_wallet_success = 'Проверьте на правильность ваш кошелек - <code>{user_wallet}</code>'
pay_balance_message = ''

from_balance_message = 'Вы уверены, что хотите списать с баланса <code>{amount} RUB</code>'

set_crypto_wallet = 'Укажите ваш крипто кошелек: '

pay_method_text = 'Выберите способ оплаты:'

pay_balance_link = 'Чтобы оплатить <code>{amount_usd} USD</code>, перейдите по ссылке: {pay_url}'
remove_balance_unsuccess = 'На балансе недостаточно средств!'
remove_balance_success = 'Успешно оплачено!'

pay_success = 'Баланс успешно пополнен!'
pay_trx_success = '✅ Транзакция успешно проведена!\n' \
              '🏛 Адрес: <code>{user_wallet}</code>\n' \
              '💰 Отправлено:  <code>{amount_trx} TRX</code>\n' \
              '🔗 Транзакция:  <a href="https://tronscan.org/#/transaction' \
              '/{transaction_id}">ссылка</a>\n' \
              '💵 С баланса списано: <code>{amount}RUB</code>\n' \
              '☘️ @ASBspamer_Bot - различные софты, товары под вас!'
pay_unsuccess = '                 ❌ Оплата не прошла!                \n' \
                'Ожидайте, или напишите администрации - @anubis_spb ❌'

user_info = 'Пользователь - <code>{username}</code>\n'\
             'ID пользователя - <code>{user_id}</code>\n'\
             'Баланс пользовател - <code>{user_balance}</code>\n'\
             'Общая сумма пополнения пользователя - <code>{user_total_amount}</code>\n'\
             'Колличество успешных транзакций пользователя - <code>{user_suc_transactions}</code>'


