greet = '🏧 Привет, <code>{name}</code>. Ты находишься в <code>EveryExchange</code>!'
menu = 'Главное меню'
info = '🏷 Количество успешных транзакций: <code>{suc_trans}</code>\n' \
       '\n' \
       '<code>- Нашли баг?</code>\n' \
       '<code>- Нет необходимого сервиса?</code>\n' \
       '<code>- Есть предложения или вопросы?</code>\n' \
       '\n' \
       'Пишем администратору: <code>@Anubis_SPB</code>'
profile_info = '❇️ Вы находитесь в своем профиле!\n' \
               '➖➖➖➖➖➖➖➖➖➖\n' \
               '🌐 ID: <code>{user_id}</code>\n' \
               '💎 Баланс: <code>{user_balance}</code> RUB\n' \
               '⏱ Общая сумма пополнения: <code>{total_amount}</code> RUB\n' \
               '💤 Проведено транзакций: <code>{suc_trans}</code> шт.\n' \
               '➖➖➖➖➖➖➖➖➖➖\n' \
               '🔗 <code>new update - coming soon</code>\n'

sum_trx_buy = 'Введите сумму пополнения. На данный момент, курс TRX: 12 рублей = 1 TRX'

buy_trx_message = '🛃 Мы подсчитали Вашу конвертацию:\n'\
                    '🅿️ Ваша сумма в RUB - <code>{amount} RUB</code>\n'\
                    '♻️ Ваша сумма в TRX - <code>{amount_change} TRX TRON</code>\n'

pay_method_text = 'Выберите способ оплаты:'

pay_success = '✅ Транзакция успешно проведена!\n' \
              '🏛 Адрес: <a href="https://tronscan.org/#/address/TFGnyeeXsMLQv52LkEHiBKFdZaiuvDHTVp">ссылка</a>\n' \
              '💰 Отправлено:  <code>39 TRX</code>\n' \
              '🔗 Транзакция:  <a href="https://tronscan.org/#/transaction' \
              '/bb169d12605e3dae342bc9c0c08d92f3d533a03e1b00d86a7b2e84c1a9f09a13">ссылка</a>\n' \
              '💵 С баланса списано: <code>{amount}RUB</code>\n' \
              '☘️ @ASBspamer_Bot - различные софты, товары под вас!'
pay_unsuccess = '                 ❌ Оплата не прошла!                \n' \
                'Ожидайте, или напишите администрации - @anubis_spb ❌'
